import { Typography } from "@material-ui/core";
import { MDBContainer } from "mdbreact";
import React from "react";

export default function m102() {
  return (
    <MDBContainer>
      <img
        style={{ paddingTop: "100px", width: "100%" }}
        src={"https://a.d-cd.net/ffd7beas-960.jpg"}
      ></img>
      <iframe width="100%" height="706" src="https://www.youtube.com/embed/gQC1Cag9coA" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
      <Typography style={{ color: "white" }}>
        Mercedes M102 AMGРядный четырехцилиндровый двигатель Mercedes-Benz M102
        появился в 1980 году в качестве замены устаревшего M115 и был разработан
        с чистого листа. В новом 102-ом семействе (в которое вошли еще 1.8 л,
        2.3 л и спортивные 2.5 литровые движки) был заново разработан блок
        цилиндров, который выполнен из чугуна, коленвалов ставилось два типа, с
        ходом 80.25 мм и 80.2 мм, соответственно рабочие объемы 1997 и 1996 куб.
        см. Восьмиклапанная ГБЦ с одними распредвалом, как и блок цилиндров,
        создана заново без применения гидрокомпенсаторов клапанных зазоров.
        Диаметр впускных клапанов 43 мм, выпускных 39 мм. В приводе ГРМ
        используется однорядная цепь, прославившаяся своей ненадежностью и
        невысоким сроком службы, в 1987 году цепь заменили на двухрядную и срок
        службы несколько увеличился. В среднем цепь ГРМ ходит 100-150 тыс. км. В
        1984 году двигатель М102 был доработан, тяжелые шатуны и коленвал
        уступили место новым облегченным, появились гидрокомпенсаторы,
        изменились опоры двигателя, маслофильтр. Вместе с рядной четверкой
        выпускался и родственный, частично унифицированный, шестицилиндровый
        двигатель М103. Замена 102-му мотору вышла в 1992 году и представляла
        собой двухлитровый двигатель семейства М111, который в течении двух лет
        вытеснила М102 с таким же рабочим объемом. Модификации двигателей М102 2
        л. 1. M102.920 (1980 — 1986 г.в.) — первая карбюраторная версия
        мощностью 109 л.с. при 5200 об/мин, крутящий момент 170 Нм при 3000
        об/мин. Карбюратор Stromberg 175 CDT, степень сжатия 9. Ставился на
        Mercedes W123. 2. M102.921 (1982 — 1984 г.в.) — упрощенная версия с
        карбюратором Stromberg 175CD, другими распредвалами, степень сажтия 9,
        мощность 90 л.с. при 5000 об/мин, крутящий момент 165 Нм при 2500
        об/мин. Ставился на Mercedes 190 W201. 3. M102.922 (1985 — 1990 г.в.) —
        доработанная версия М102.920 с легкими шатунам, коленвалом и прочим
        вышеописанным, карбюратор Stromberg 175 CDT. Версия адаптирована для
        Mercedes W124. Степень сжатия 9, мощность 109 л.с. при 5500 об/мин,
        крутящий момент 170 Нм при 3000 об/мин. С 1986 года карбюратор заменен
        на Pierburg 2 E-E. Ставился на Mercedes W124. 4. M102.924 (1984 — 1991
        г.в.) — доработанная версия М102.921 с легкими шатунам, коленвалом и
        прочим вышеописанным, карбюратор до 1986 года ставился Stromberg 175
        CDT, дальше Pierburg 2 E-E Версия адаптирована для Mercedes W124.
        Степень сжатия 9, мощность 109 л.с. при 5500 об/мин, крутящий момент 170
        Нм при 3000 об/мин. С 1986 года карбюратор заменен на Pierburg 2 EE.
        Ставился на Mercedes 190 W201. 5. M102.938 (1982 — 1984 г.в.) — аналог
        М102.921, степень сжатия снижена до 8, мощность упала до 86 л.с.
        Ставился на Mercedes 190 W201. 6. M102.939 (1980 — 1985 г.в.) — аналог
        М102.920, степень сжатия снижена до 8, мощность упала до 101 л.с.
        Ставился на Mercedes W123. 7. M102.962 (1982 — 1993 г.в.) — аналог
        М102.921 с впрыском Bosch KE-Jetronic, степень сжатия 9, мощность упала
        до 122 л.с. при 5500 об/мин, крутящий момент 178 Нм при 3500 об/мин, для
        версии с катализатором мощность 118 л.с., момент 172 Нм. Ставился мотор
        на Mercedes 190 W201. 8. M102.963 (1985 — 1992 г.в.) — аналог
        вышеописанной модели для использования в Mercedes W124. 9. M102.964
        (1986 — 1991 г.в.) — аналог вышеописанной модели для использования в
        Mercedes Gelandewagen W460. 10. M102.965 (1990 — 1994 г.в.) — аналог
        вышеописанной модели с коленвалом ход поршня которого 80.2 мм (был 80.25
        мм), рабочий объем 1996 см³. Двигатель ставился в Mercedes Gelandewagen
        W463. 
        <br/>
        МОДИФИКАЦИЯ: M 102 E 18 Точный объем 1797 см³ Система питания
        KE-Jetronic Мощность двс 109 л.с. Крутящий момент 150 Нм Блок цилиндров
        чугунный R4 Головка блока алюминиевая 8v Диаметр цилиндра 89 мм Ход
        поршня 72.2 мм Степень сжатия 9.0 Особенности двс нет Гидрокомпенсаторы
        да Привод ГРМ двухрядная цепь Фазорегулятор нет Турбонаддув нет Какое
        масло лить 5.0 литра 5W-40 Тип топлива АИ-92 Экологический класс ЕВРО
        0/1 Примерный ресурс 400 000 км
      </Typography>
    </MDBContainer>
  );
}
